package com.enuos.live.task;

/**
 * @Description 任务模板枚举
 * @Author wangyingjie
 * @Date 2020/10/22
 * @Modified
 */
public enum TemplateEnum {

    /** 登陆 */
    L01("L01", "每日登陆"),

    /** 签到 */
    S01("S01", "累计签到{0}天"),
    S02("S02", "每日签到"),
    S03("S03", "连续签到{0}天"),

    /** 活跃 */
    H01("H01", "每日活跃{0}"),
    H02("H02", "每周活跃{0}"),
    H03("H03", "会员每日活跃"),

    /** 动态 */
    P01("P01", "累计发布{0}条及以上动态"),
    P02("P02", "每日动态分享"),
    P03("P03", "好友动态点赞{0}次"),
    P04("P04", "7LE广场点赞{0}次"),

    /** 语音 */
    V01("V01", "关注任意语音房"),
    V02("V02", "开启房间且有{0}人及以上关注"),
    V03("V03", "在任意语音房发言{0}次"),
    V04("V04", "在任意语音房上麦{0}次"),
    V05("V05", "分享任意语音房"),
    V06("V06", "玩语音房{0}分钟"),
    V07("V07", "在任意语音房赠送任意礼物{0}次"),

    /** 活动 */
    A01("A01", "丹枫迎秋"),
    A02("A02", "欢度国庆"),
    A03("A03", "金秋送福"),
    A04("A04", "乐享令状"),

    /** 兑换 */
    E01("E01", "{0}金币兑换"),
    E02("E02", "{0}钻石兑换"),
    E03("E03.{0}", "{0}兑换"),

    /** 邀请 */
    I01("I01", "邀请首位好友赢额外奖励"),

    /** 充值 */
    R01("R01", "充值任意金额"),

    /** 扭蛋 */
    N01("N01", "扭蛋抽奖{0}*{1}"),
    N02("N02", "扭蛋兑换{0}*{1}"),

    /** 等级 */
    D01("D01", "恭喜升级到{0}级，获得奖励{1}"),

    /** 会员 */
    M01("M01", "开通会员"),
    M02("M02", "会员等级达到{0}级"),
    M03("M03", "会员专属"),

    /** 魅力 */
    C01("C01", "魅力值达到{0}点"),

    /** 好友 */
    F01("F01", "添加好友{0}名"),
    F02("F02", "好友聊天{0}次"),

    /** 宠物 */
    W01("W01", "喂食{0}次"),
    W02("W02", "帮好友喂食{0}次"),
    W03("W03", "互动{0}次"),
    W04("W04", "帮好友互动{0}次"),
    W05("W05", "打招呼{0}次"),
    W06("W06", "前往{0}个不同小院"),
    W07("W07", "更换{0}次装扮"),
    W08("W08", "打开{0}次盲盒"),

    /** 游戏 */
    G01("G01", "累计{0}天玩小游戏达到{1}分钟"),
    G02("G02", "邀请好友玩小游戏达到{0}分钟"),
    G03("G03", "与好友玩{0}局{1}"),
    G04("G04", "玩{0}局对战游戏"),
    G05("G05", "玩{0}局互动游戏"),
    G06("G06", "与好友玩{0}局对战游戏"),
    G07("G07", "与好友玩{0}局互动游戏"),
    G08("G08", "累计玩{0}局游戏"),
    G09("G09", "玩{0}局{1}"),
    G10("G10", "赢{0}局{1}"),
    G11("G11", "在{0}中，累计{1}"),
    G12("G12", "在{0}中，单局{1}"),

    /** 排行榜 */
    RANK("RANK", "排行榜"),

    /** 阶 */
    STEP("STEP", "阶");

    public final String CODE;

    public final String NAME;

    TemplateEnum(String CODE, String NAME) {
        this.CODE = CODE;
        this.NAME = NAME;
    }
}
