package com.enuos.live.manager;

/**
 * @Description 成就枚举
 * @Author wangyingjie
 * @Date 2020/7/10
 * @Modified
 */
public enum AchievementEnum {

    AMT("AMT","成就前缀", "成就前缀"),

    AMT0001("AMT0001_3000","星罗棋布", "在五子棋中，累计落子3000颗"),
    AMT0002("AMT0002_200","天人合一", "在五子棋中，累计占据中央天元200次"),
    AMT0003("AMT0003_1","半壁江山", "在五子棋中，单局双方棋子占据超过一半的棋盘"),
    AMT0004("AMT0004_1","棋逢对手", "在五子棋中，单局双方共有8个及以上4连"),

    AMT0005("AMT0005_200","河东狮吼", "在斗兽棋中，累计使用狮吃掉其他棋子200次"),
    AMT0006("AMT0006_100","驱虎吞狼", "在斗兽棋中，累计使用虎吃掉狼100次"),
    AMT0007("AMT0007_30","猫捉老鼠", "在斗兽棋中，累计使用猫吃掉鼠30次"),
    AMT0008("AMT0008_20","鼠胆英雄", "在斗兽棋中，累计使用鼠吃掉象20次"),

    AMT0009("AMT0009_100","弹射起步", "在飞行棋中，累计跳子100次"),
    AMT0010("AMT0010_20","回到原点", "在飞行棋中，累计被撞子20次"),
    AMT0011("AMT0011_10","穿越虫洞", "在飞行棋中，累计飞棋10次"),
    AMT0012("AMT0012_1","原地转圈", "在飞行棋中，单局在终点区域兜圈3圈及以上到达终点"),

    AMT0013("AMT0013_200","排雷先锋", "在扫雷中，累计正确标记地雷200次"),
    AMT0014("AMT0014_50","我是炮灰", "在扫雷中，累计踩地雷50次"),
    AMT0015("AMT0015_10","重复工作", "在扫雷中，累计与对手进行相同操作10次"),
    AMT0016("AMT0016_1","拆弹专家", "在扫雷中，单局正确标记地雷12颗及以上"),

    AMT0017("AMT0017_200","慧眼如炬", "在你画我猜中，累计猜中200次"),
    AMT0018("AMT0018_10","抽象画家", "在你画我猜中，累计让所有其他玩家都猜不中10次"),
    AMT0019("AMT0019_10","灵魂画师", "在你画我猜中，累计让所有其他玩家都猜中10次"),
    AMT0020("AMT0020_10","心有灵犀", "在你画我猜中，累计只有1个玩家猜中10次"),

    AMT0021("AMT0021_200","心领神会", "在你说我猜中，累计猜中200次"),
    AMT0022("AMT0022_10","天花乱坠", "在你说我猜中，累计让所有其他玩家都猜不中10次"),
    AMT0023("AMT0023_10","绘声绘色", "在你说我猜中，累计让所有其他玩家都猜中10次"),
    AMT0024("AMT0024_10","心心相印", "在你说我猜中，累计只有1个玩家猜中10次"),

    AMT0025("AMT0025_30","无间风云", "在谁是卧底中，累计作为卧底并获胜30次"),
    AMT0026("AMT0026_20","躺枪群众", "在谁是卧底中，累计作为平民被投死20次"),
    AMT0027("AMT0027_10","利刃出鞘", "在谁是卧底中，累计作为平民在第一回合投出卧底并获胜10次"),
    AMT0028("AMT0028_10","决战黎明", "在谁是卧底中，累计作为卧底并猜出平民词10次"),

    AMT0029("AMT0029_100","双倍快乐", "在一站到底中，累计使用加倍并答对100次"),
    AMT0030("AMT0030_10","站神无双", "在一站到底中，累计答对全部10道题目并获胜10次"),
    AMT0031("AMT0031_1","快狠准稳", "在一站到底中，单局答对全部10道题目且每道题用时小于2秒"),
    AMT0032("AMT0032_1","大智若愚", "在一站到底中，单局答错全部10道题目"),

    AMT0033("AMT0033_50","质疑精神", "在UNO中，累计质疑上家50次"),
    AMT0034("AMT0034_20","反将一军", "在UNO中，累计质疑成功20次"),
    AMT0035("AMT0035_10","牌差一着", "在UNO中，累计在UNO状态下失去第一10次"),
    AMT0036("AMT0036_50","抽卡人生", "在UNO中，累计主动抽牌50次"),

    AMT0037("AMT0037_50","大预言术", "在炸弹猫中，累计使用先知50次"),
    AMT0038("AMT0038_1","神选英杰", "在炸弹猫中，单局没有摸到1次炸弹获得第一"),
    AMT0039("AMT0039_20","有求必应", "在炸弹猫中，累计被使用祈求送出20张卡"),
    AMT0040("AMT0040_100","巫毒诅咒", "在炸弹猫中，累计使用诅咒100次"),

    AMT0041("AMT0041_999","高级玩家", "累计玩999把游戏"),
    AMT0042("AMT0042_9999","头号玩家", "累计玩9999把游戏"),

    AMT0043("AMT0043_30","风雨无阻", "连续打卡30天"),
    AMT0044("AMT0044_180","海枯石烂", "连续打卡180天"),

    AMT0045("AMT0045_10","新人主播", "开启房间且有10人及以上关注"),
    AMT0046("AMT0046_100","王牌主播", "开启房间且有100人及以上关注"),

    AMT0047("AMT0047_10","我型我秀", "累计发布10条及以上动态"),
    AMT0048("AMT0048_50","多彩人生", "累计发布50条及以上动态"),

    AMT0049("AMT0049_100","人见人爱", "魅力值达到100点"),
    AMT0050("AMT0050_10000","花见花开", "魅力值达到10000点"),

    AMT0051("AMT0051_1","名誉男爵", "开通会员"),
    AMT0052("AMT0052_2","高贵子爵", "会员等级达到2级"),
    AMT0053("AMT0053_4","豪华伯爵", "会员等级达到4级"),
    AMT0054("AMT0054_6","荣耀侯爵", "会员等级达到6级"),
    AMT0055("AMT0055_7","传奇公爵", "会员等级达到7级"),
    AMT0056("AMT0056_8","至尊帝王", "会员等级达到8级"),

    AMT0057("AMT0057_1","秋水伊人", "金秋活动获得"),

    AMT0058("AMT0058_1","我爱祖国", "国庆活动获得");

    private String code;

    private String title;

    private String description;

    AchievementEnum(String code, String title, String description) {
        this.code = code;
        this.title = title;
        this.description = description;
    }

    public String getCode() {
        return code;
    }

}