package com.enuos.live.manager;

/**
 * @Description 任务枚举
 * @Author wangyingjie
 * @Date 2020/7/20
 * @Modified
 */
public enum TaskEnum {

    /** 每日每周活跃 */
    DAT0001("DAT0001","每日活跃", "每日活跃"),
    WAT0001("WAT0001","每周活跃", "每周活跃"),

    /** 日常 */
    DLT0001("DLT0001_1","每日登陆", "每日登陆"),
    PMT0001("PMT0001_1","充值任意金额", "充值任意金额"),

    PGT0001("PGT0001_3","玩3局五子棋", "玩3局五子棋"),
    PGT0002("PGT0002_3","玩3局斗兽棋", "玩3局斗兽棋"),
    PGT0003("PGT0003_1","玩1局飞行棋", "玩1局飞行棋"),
    PGT0004("PGT0004_3","玩3局扫雷", "玩3局扫雷"),
    PGT0005("PGT0005_1","玩1局你画我猜", "玩1局你画我猜"),
    PGT0006("PGT0006_1","玩1局你说我猜", "玩1局你说我猜"),
    PGT0007("PGT0007_1","玩1局谁是卧底", "玩1局谁是卧底"),
    PGT0008("PGT0008_3","玩3局一站到底", "玩3局一站到底"),
    PGT0009("PGT0009_1","玩1局狼人杀", "玩1局狼人杀"),
    PGT0010("PGT0010_1","赢1局五子棋", "赢1局五子棋"),
    PGT0011("PGT0011_1","赢1局斗兽棋", "赢1局斗兽棋"),
    PGT0012("PGT0012_1","赢1局扫雷", "赢1局扫雷"),
    PGT0013("PGT0013_1","赢1局一站到底", "赢1局一站到底"),
    PGT0014("PGT0014_1","与好友玩1局五子棋", "与好友玩1局五子棋"),
    PGT0015("PGT0015_1","与好友玩1局斗兽棋", "与好友玩1局斗兽棋"),
    PGT0016("PGT0016_1","与好友玩1局扫雷", "与好友玩1局扫雷"),
    PGT0017("PGT0017_1","与好友玩1局一站到底", "与好友玩1局一站到底"),
    PGT0018("PGT0018_1","在斗兽棋中，使用狗吃掉其他棋子3次", "在斗兽棋中，使用狗吃掉其他棋子3次"),
    PGT0019("PGT0019_1","在飞行棋中，将对手撞回基地1次", "在飞行棋中，将对手撞回基地1次"),
    PGT0020("PGT0020_5","在扫雷中，累计正确标记地雷5次", "在扫雷中，累计正确标记地雷5次"),
    PGT0021("PGT0021_1","在你画我猜中，累计猜中5次", "在你画我猜中，累计猜中5次"),
    PGT0022("PGT0022_1","在你说我猜中，累计猜中5次", "在你说我猜中，累计猜中5次"),
    PGT0023("PGT0023_1","在谁是卧底中，存活3轮及以上", "在谁是卧底中，存活3轮及以上"),
    PGT0024("PGT0024_1","在一站到底中，连续答对5道题", "在一站到底中，连续答对5道题"),
    PGT0025("PGT0025_1","在狼人杀中，当1次狼人", "在狼人杀中，当1次狼人"),
    PGT0026("PGT0026_1","在狼人杀中，竞选1次警长", "在狼人杀中，竞选1次警长"),

    PGT0027("PGT0027_1","朋友圈点赞1次", "朋友圈点赞1次"),
    PGT0028("PGT0028_1","广场点赞1次", "广场点赞1次"),
    PGT0029("PGT0029_1","在任意语音房观看1分钟及以上", "在任意语音房观看1分钟及以上"),
    PGT0030("PGT0030_1","关注任意语音房", "关注任意语音房"),
    PGT0031("PGT0031_1","分享任意语音房", "分享任意语音房"),
    PGT0032("PGT0032_1","在任意语音房发言1次", "在任意语音房发言1次"),
    PGT0033("PGT0033_1","在任意语音房上麦1次", "在任意语音房上麦1次"),
    PGT0034("PGT0034_1","在任意语音房赠送任意礼物", "在任意语音房赠送任意礼物"),
    PGT0035("PGT0035_1","会员每日活跃", "会员每日活跃"),

    /** 升级任务 */
    LVT0001("LVT0001","升级", "恭喜升级到{0}级，获得奖励{1}");

    private String code;

    private String title;

    private String description;

    TaskEnum(String code, String title, String description) {
        this.code = code;
        this.title = title;
        this.description = description;
    }

    public String getCode() {
        return code;
    }

}
